"use strict";
// Задача №1
// Що потрапить в консоль?

let someVar = 0; //Оголосили someVar якій присвоїли значення 0
++someVar; //Інкрементували змінну і тепер someVar = 1;

if (someVar) { //Перевірка умови, якщо значення правдиве то йде виконання, якщо ні, то пропуск, в даному випадку умова вірна бо someVar = 1
	console.log(someVar); //Виводимо у консоль значення someVar яке рівне 1
}

// Задача №2
// За допомогою циклу FOR виведіть в консоль 10 рядків:
// Пункт №1
// Пункт №2
// і т.д.

for (let i = 1; i <= 10; i++) { // створюємо цикл фор який стартує з 1 бо пункти починаються з 1 який менше рівно 10 бо завершується пункт на 10.
  console.log(`Пункт №${i}`) //Виводимо текст зворотнімі бектіками `` і всередині до тексту який нам потрібен при кожній ітерації замінуємо цифру пункту яка рівна номеру ітерації
}


// Задача №3
// Що потрапить в консоль ?
if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
  // (false || false && true || false)
  // (false || false || false) так як усі варіанти false то умова не буде працювати, якщо ми наприклад заміними строге порівняння 20 === '20' на 20 == '20' тоді умова буде працювати так як у нас буде хоча б 1 варіант true з поміж усіх АБО(||);
	console.log('000'); //В консоль нічого не потрапить
}

// Задача №4
// Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
// Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
// Функція не має повертати NaN, Infinite або помилку 

function divide(a, b) {
  if(b === 0){
    console.log("Ах ти шалунішка, на 0 ділити не можна, прийнамні в школі :D") //Перевірка ділення на 0 оскільки при діленні на 0 буде нескінченність
  } else {
    let result = a / b; // записуємо результат ділення
    if (isNaN(result)){ //робимо перевірку на NaN, оскільки якщо в один з аргументів вписати строку то при діленні буде значення NaN, аналогічно якщо один з аргументів не вписувати, або ж якщо взагалі пропустити обидва, то аргументи будуть undefined undefined і знову ж при діленні undefined/undefined буде NaN, якось так))
      console.log("Помилка: перевірте введені дані!");
    } else {
      console.log(`Результат ділення: ${result}`); //Якщо все ок то виводимо результат
    }
  }
}
divide(1, 6);
divide(10, 5);
divide(-1, 2);
divide(1, 0)
divide("fff", 2)
divide("fff")
divide("")
divide()

// Задача №5
// Створіть масив даних - 5 елементів, один з яких число 10
// Обробіть масив за допомогою методу перебору
// Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль

let arr = [2, "Hello", 6, 10, false] //Створили масив з даними
arr.forEach((e, i) => {// перебір масиву методом forEach
  if (e == 10){ //Перевірка чи елемент масиву рівний 10, тут можна і використати строге порівняння але дивлячись які будуть у нас вхідні дані.
    console.log(e) //Виведення в консоль нашої 10 
    console.log(`Ваша 10 знаходиться на ${i + 1} місці`) // Виведення інформації на якому місці в масиві з точки зору звичайного користувача стояла наша 10
  }
});